app/Controllers/News.php


                $this->builder->where('news_id', $newsId);

                if($this->builder->update($datas)) {
---
UPDATE `news` SET `title` = 'Berita 1', `content` = '<p>Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint cc occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.</p>'
WHERE `news_id` = '202306122253070'